docs/blog/2024-09-03_email-dev-servers/index.html
<!DOCTYPE html>
<html lang="en">
    <head>
        
    
            <meta charset="UTF-8">
            <title>Development Email Servers - hyperimpose</title>
            <meta name=viewport content="width=device-width, initial-scale=1">
            <link rel="stylesheet" href="/static/layout.css" />
        
    <link rel="stylesheet" href="/static/blog.css"/>

    </head>

    <body>
        <header>
            <nav>
                <div class="nav-container">
                    <a class="logo" href="http://hyperimpose.org"></a>
                    <div class="menu_links">
                        <a href="/blog">[blog]</a>
                    </div>
                </div>
            </nav>

            
                <div class="breadcrumbs">
                    <span>
                        
                            
                                <a href="/">hyperimpose.org</a>
                                /
                            
                        
                            
                                <a href="/blog">blog</a>
                                /
                            
                        
                            
                                Development Email Servers
                            
                        
                    </span>
                </div>
            
        </header>

        <main>
            
                <article id="content">
    <!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-09-03 Tue 19:41 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<style>ul { list-style-type: none; }</style>
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org0da3389" class="outline-2">
<h2 id="org0da3389">Development Email Servers</h2>
<div class="outline-text-2" id="text-org0da3389">
<p>
This is a collection of development email servers. Such servers can be used to develop and test
programs that need to send outgoing email. They work by providing an SMTP server that "traps"
all outgoing emails and instead of sending them to the recipient address, it presents them
in a custom inbox.
</p>

<p>
The servers listed are split in two sections. In the recommended section are servers that fullfil
the following criteria: Easy to configure, Provides docker images, Supports TLS.
</p>
</div>

<div id="outline-container-org6147f24" class="outline-3">
<h3 id="org6147f24">Recommended</h3>
<div class="outline-text-3" id="text-org6147f24">
<ul class="org-ul">
<li><a href="https://github.com/rnwood/smtp4dev">smtp4dev</a> - Resizable viewport, HTML validation and compatibility report, Auto self-signed cert generation.</li>
<li><a href="https://github.com/maildev/maildev">maildev</a> - Resizable viewport, You must provide the certs yourself.</li>
</ul>
</div>
</div>

<div id="outline-container-org95928d6" class="outline-3">
<h3 id="org95928d6">Others</h3>
<div class="outline-text-3" id="text-org95928d6">
<ul class="org-ul">
<li><a href="https://github.com/mailslurper/mailslurper">MailSlurper</a> - You must provide the certs yourself. The docker image did not run when tried.</li>
<li><a href="https://github.com/mailhog/MailHog">MailHog</a> - Does not seem to support TLS.</li>
<li><a href="https://github.com/sj26/mailcatcher">MailCatcher</a> - Does not seem to support TLS.</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>

</article>
            
        </main>

        <footer>
            <div class="copyright">
                <p>Copyright © 2024 <a href="http://hyperimpose.org">hyperimpose.org</a>.&nbsp</p>
                <p> Licensed under <a href="https://creativecommons.org/licenses/by-nd/4.0/">CC BY-ND 4.0</a>.</p>
            </div>
            <p>
                <a href="https://github.com/hyperimpose">[github]</a>
                &nbsp
                <a href="mailto:hyperimpose@protonmail.com">[email]</a>
            </p>
        </footer>

    </body>
</html>